# Rebar Create From Curves Method

Source: https://www.revitapidocs.com/2026/069ab1d6-e41d-de8e-cc56-8f4d6e776926.htm

---

| Rebar Create From Curves Method |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | CreateFromCurves(Document, RebarStyle, RebarBarType, Element, XYZ, IList Curve , BarTerminationsData, Boolean, Boolean) |  |
|  | CreateFromCurves(Document, RebarStyle, RebarBarType, RebarHookType, RebarHookType, Element, XYZ, IList Curve , RebarHookOrientation, RebarHookOrientation, Boolean, Boolean) | **Obsolete.** |
|  | CreateFromCurves(Document, RebarStyle, RebarBarType, RebarHookType, RebarHookType, Element, XYZ, IList Curve , RebarHookOrientation, RebarHookOrientation, Double, Double, ElementId, ElementId, Boolean, Boolean) | **Obsolete.** |

Top See Also

#### Reference

Rebar Class Autodesk.Revit.DB.Structure Namespace